// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел. 
// Например: 2, 3, 7 -> 7; 44 5 78 -> 78; 22 3 9 -> 22.

Console.WriteLine("Hello, World!");
